Nonameflase/SimWheel/Code/STM32/02_LCD/Hardware/Lcd/lcd.h
//////////////////////////////////////////////////////////////////////////////////	 
// 本程序只供学习使用，未经作者许可，不得用于其它任何用途
// 测试硬件：单片机STM32F407ZGT6,正点原子Explorer STM32F4开发板,主频168MHZ，晶振12MHZ
// QDtech-TFT液晶驱动 for STM32 IO模拟 -> 已移植到HAL库
// xiao冯@ShenZhen QDtech co.,LTD
// 公司网站:www.qdtft.com
// 淘宝网站：http://qdtech.taobao.com
// wiki技术网站：http://www.lcdwiki.com
// 我司提供技术支持，任何技术问题欢迎随时交流学习
// 固话(传真) :+86 0755-23594567 
// 手机:15989313508（冯工） 
// 邮箱:lcdwiki01@gmail.com    support@lcdwiki.com    goodtft@163.com 
// 技术支持QQ:3002773612  3002778157
// 技术交流QQ群:324828016
// 创建日期:2018/08/09
// 版本：V1.0 (HAL库移植版)
// 版权所有，盗版必究。
// Copyright(C) 深圳市全动电子技术有限公司 2018-2028
// All rights reserved
/****************************************************************************************************
//=========================================电源接线================================================//
//     LCD模块                STM32单片机
//      VCC          接        DC5V/3.3V      //电源
//      GND          接          GND          //电源地
//=======================================液晶屏数据线接线==========================================//
// 本模块默认数据总线类型为SPI总线
//     LCD模块                STM32单片机    
//    SDI(MOSI)      接          PB5          //液晶屏SPI总线数据写信号
//    SDO(MISO)      接          PB4          //液晶屏SPI总线数据读信号，如果不需要读，可以不接线
//=======================================液晶屏控制线接线==========================================//
//     LCD模块 					      STM32单片机 
//       LED         接          PB13         //液晶屏背光控制信号，如果不需要控制，接5V或3.3V
//       SCK         接          PB3          //液晶屏SPI总线时钟信号
//      DC/RS        接          PB14         //液晶屏数据/命令控制信号
//       RST         接          PB12         //液晶屏复位控制信号
//       CS          接          PB15         //液晶屏片选控制信号
//=========================================触摸屏触接线=========================================//
// 如果模块不带触摸功能或者带有触摸功能，但是不需要触摸功能，则不需要进行触摸屏接线
//	   LCD模块                STM32单片机 
//      T_IRQ        接          PB1          //触摸屏触摸中断信号
//      T_DO         接          PB2          //触摸屏SPI总线读信号
//      T_DIN        接          PF11         //触摸屏SPI总线写信号
//      T_CS         接          PC5          //触摸屏片选控制信号
//      T_CLK        接          PB0          //触摸屏SPI总线时钟信号
**************************************************************************************************/		
/* @attention
 *
 * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
 * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
 * TIME. AS A RESULT, QD electronic SHALL NOT BE HELD LIABLE FOR ANY
 * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
 * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
 * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
**************************************************************************************************/	
#ifndef __LCD_H
#define __LCD_H		

#include "stm32f4xx_hal.h"   // 使用HAL库
#include "stdlib.h"

#ifndef u8
#define u8 uint8_t
#endif

#ifndef u16
#define u16 uint16_t
#endif

#ifndef u32
#define u32 uint32_t
#endif

// LCD重要参数集
typedef struct  
{										    
	u16 width;			// LCD 宽度
	u16 height;			// LCD 高度
	u16 id;				// LCD ID
	u8  dir;			// 横屏还是竖屏控制：0，竖屏；1，横屏。	
	u16	 wramcmd;		// 开始写gram指令
	u16  setxcmd;		// 设置x坐标指令
	u16  setycmd;		// 设置y坐标指令	 
}_lcd_dev; 	

// LCD参数
extern _lcd_dev lcddev;	// 管理LCD重要参数

/////////////////////////////////////用户配置区///////////////////////////////////	 
#define USE_HORIZONTAL  	 0   // 定义液晶屏顺时针旋转方向 	0-0度旋转，1-90度旋转，2-180度旋转，3-270度旋转
//////////////////////////////////////////////////////////////////////////////////	  

// 定义LCD的尺寸
#define LCD_W 240
#define LCD_H 320

// TFTLCD部分外要调用的函数		   
extern u16  POINT_COLOR;  // 默认红色    
extern u16  BACK_COLOR;   // 背景颜色.默认为白色

////////////////////////////////////////////////////////////////////
//-----------------LCD端口定义---------------- 

// ---------- 以下宏定义已移植到HAL库，使用HAL_GPIO_WritePin ----------
// 液晶控制口置1操作语句宏定义
#define LCD_CS_SET          HAL_GPIO_WritePin(PORT_LCD_CS,   GPIO_LCD_CS,   GPIO_PIN_SET)
#define LCD_RS_SET          HAL_GPIO_WritePin(PORT_LCD_DC,   GPIO_LCD_DC,   GPIO_PIN_SET)
#define LCD_SDA_SET         HAL_GPIO_WritePin(PORT_LCD_SDA,  GPIO_LCD_SDA,  GPIO_PIN_SET)
#define LCD_SCL_SET         HAL_GPIO_WritePin(PORT_LCD_SCL,  GPIO_LCD_SCL,  GPIO_PIN_SET)
#define LCD_RST_SET         HAL_GPIO_WritePin(PORT_LCD_RES,  GPIO_LCD_RES,  GPIO_PIN_SET)
#define LCD_LED_SET         HAL_GPIO_WritePin(PORT_LCD_BLK,  GPIO_LCD_BLK,  GPIO_PIN_SET)

// 液晶控制口置0操作语句宏定义
#define LCD_CS_CLR          HAL_GPIO_WritePin(PORT_LCD_CS,   GPIO_LCD_CS,   GPIO_PIN_RESET)
#define LCD_RS_CLR          HAL_GPIO_WritePin(PORT_LCD_DC,   GPIO_LCD_DC,   GPIO_PIN_RESET)
#define LCD_SDA_CLR         HAL_GPIO_WritePin(PORT_LCD_SDA,  GPIO_LCD_SDA,  GPIO_PIN_RESET)
#define LCD_SCL_CLR         HAL_GPIO_WritePin(PORT_LCD_SCL,  GPIO_LCD_SCL,  GPIO_PIN_RESET)
#define LCD_RST_CLR         HAL_GPIO_WritePin(PORT_LCD_RES,  GPIO_LCD_RES,  GPIO_PIN_RESET)
#define LCD_LED_CLR         HAL_GPIO_WritePin(PORT_LCD_BLK,  GPIO_LCD_BLK,  GPIO_PIN_RESET)

//-----------------LCD端口移植---------------- 
// VCC - 3.3V
// SCL - PB10         SPI_SCK
// SDA - PB15         SPI_MOSI
// RES - PD9          (可以接入复位)
// DC  - PD8
// CS  - PB12          SPI_NSS
// BLK - PD10

#define RCC_LCD1		RCC_AHB1Periph_GPIOA  // 保留原宏名，实际在HAL中用__HAL_RCC_xxx
#define RCC_LCD2		RCC_AHB1Periph_GPIOB
#define RCC_LCD3		RCC_AHB1Periph_GPIOD

// SCK
#define PORT_LCD_SCL    GPIOB
#define GPIO_LCD_SCL    GPIO_PIN_10

// MOSI
#define PORT_LCD_SDA    GPIOB
#define GPIO_LCD_SDA    GPIO_PIN_15

// MISO (读，本驱动未使用读功能)
#define PORT_LCD_MIS    GPIOB
#define GPIO_LCD_MIS    GPIO_PIN_14

// NSS (片选)
#define PORT_LCD_CS     GPIOB
#define GPIO_LCD_CS     GPIO_PIN_12

// DC (数据/命令)
#define PORT_LCD_DC     GPIOD
#define GPIO_LCD_DC     GPIO_PIN_8

// RES (复位)
#define PORT_LCD_RES    GPIOD
#define GPIO_LCD_RES    GPIO_PIN_9

// BLK (背光)
#define PORT_LCD_BLK    GPIOD
#define GPIO_LCD_BLK    GPIO_PIN_10

// CS2 / T_CS (触摸屏片选，未使用)
#define PORT_LCD_CS2    GPIOA
#define GPIO_LCD_CS2    GPIO_PIN_4

// PEN / T_IRQ (触摸屏中断，未使用)
#define PORT_LCD_PEN    GPIOA
#define GPIO_LCD_PEN    GPIO_PIN_0

// T_CLK (触摸屏时钟，未使用)
#define PORT_LCD_TCLK   GPIOA
#define GPIO_LCD_TCLK   GPIO_PIN_5

// T_DIN (触摸屏数据输入，未使用)
#define PORT_LCD_TDIN   GPIOA
#define GPIO_LCD_TDIN   GPIO_PIN_3

// T_DO (触摸屏数据输出，未使用)
#define PORT_LCD_TD0    GPIOA
#define GPIO_LCD_TD0    GPIO_PIN_1

// 画笔颜色
#define WHITE       0xFFFF
#define BLACK      	0x0000	  
#define BLUE       	0x001F  
#define BRED        0XF81F
#define GRED 			 	0XFFE0
#define GBLUE			 	0X07FF
#define RED         0xF800
#define MAGENTA     0xF81F
#define GREEN       0x07E0
#define CYAN        0x7FFF
#define YELLOW      0xFFE0
#define BROWN 			0XBC40  // 棕色
#define BRRED 			0XFC07  // 棕红色
#define GRAY  			0X8430  // 灰色
// GUI颜色
#define DARKBLUE      	 0X01CF	// 深蓝色
#define LIGHTBLUE      	 0X7D7C	// 浅蓝色  
#define GRAYBLUE       	 0X5458 // 灰蓝色
// 以上三色为PANEL的颜色 
#define LIGHTGREEN     	0X841F // 浅绿色
#define LIGHTGRAY      	0XEF5B // 浅灰色(PANNEL)
#define LGRAY 			 		0XC618 // 浅灰色(PANNEL),窗体背景色
#define LGRAYBLUE      	0XA651 // 浅灰蓝色(中间层颜色)
#define LBBLUE          0X2B12 // 浅棕蓝色(选择条目的反色)

// 函数声明
void LCD_Init(void);
void LCD_DisplayOn(void);
void LCD_DisplayOff(void);
void LCD_Clear(u16 Color);	 
void LCD_SetCursor(u16 Xpos, u16 Ypos);
void LCD_DrawPoint(u16 x,u16 y);      // 画点
u16  LCD_ReadPoint(u16 x,u16 y);      // 读点
void LCD_DrawLine(u16 x1, u16 y1, u16 x2, u16 y2);
void LCD_DrawRectangle(u16 x1, u16 y1, u16 x2, u16 y2);		   
void LCD_SetWindows(u16 xStar, u16 yStar,u16 xEnd,u16 yEnd);
u16 LCD_RD_DATA(void);                // 读取LCD数据									    
void LCD_WriteReg(u8 LCD_Reg, u16 LCD_RegValue);
void LCD_WR_DATA(u8 data);
u16 LCD_ReadReg(u8 LCD_Reg);
void LCD_WriteRAM_Prepare(void);
void LCD_WriteRAM(u16 RGB_Code);
u16 LCD_ReadRAM(void);		   
u16 LCD_BGR2RGB(u16 c);
void LCD_SetParam(void);
void Lcd_WriteData_16Bit(u16 Data);
void LCD_direction(u8 direction);

//如果仍然觉得速度不够快，可以使用下面的宏定义,提高速度.
//注意要去掉lcd.c中void LCD_WR_DATA(u16 data)函数定义哦
/*
#if LCD_USE8BIT_MODEL==1//使用8位并行数据总线模式
	#define LCD_WR_DATA(data){\
	LCD_RS_SET;\
	LCD_CS_CLR;\
	DATAOUT(data);\
	LCD_WR_CLR;\
	LCD_WR_SET;\
	DATAOUT(data<<8);\
	LCD_WR_CLR;\
	LCD_WR_SET;\
	LCD_CS_SET;\
	}
	#else//使用16位并行数据总线模式
	#define LCD_WR_DATA(data){\
	LCD_RS_SET;\
	LCD_CS_CLR;\
	DATAOUT(data);\
	LCD_WR_CLR;\
	LCD_WR_SET;\
	LCD_CS_SET;\
	} 	
#endif
*/

#endif
